content/049/results/vegeta-simple.txt
Requests      [total, rate, throughput]         7500, 500.07, 500.06
Duration      [total, attack, wait]             14.998s, 14.998s, 196.878µs
Latencies     [min, mean, 50, 90, 95, 99, max]  30.858µs, 49.673µs, 46.142µs, 62.081µs, 72.192µs, 96.994µs, 472.363µs
Bytes In      [total, mean]                     690000, 92.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:7500  
Error Set: